backend/test/artillery/stress_test.yaml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 300           # 10 minutes total
      arrivalRate: 100        # spawn up to 100 users/sec
      maxVusers: 100          # maintain exactly ~100 concurrent users
      name: 'Sustained 100 Concurrent Users'

  payload:
    path: 'payload.csv'
    fields:
      - exePath
      - input
    order: sequence
    skipHeader: true

scenarios:
  - name: "Execute binary"
    flow:
      - post:
          url: '/api/v1/execute'
          json:
            exePath: '{{ exePath }}'
            input: '{{ input }}'